# Ex 4.1: Part 2 (Outside Class)

In [2]:
import pandas as pd

In [3]:
# Hardcode a dataframe 
df_employees = pd.DataFrame( 
    [ 
    [1699,'  Robinett, David  ','  david22@adventure-works.com  ', '(827) 525-0100', '06-05-2010', '$80,950'],  
    [1700,'  Robinson, Rebecca  ','  rebecca5 @adventure-works.com  ', '(829) 525-0101', '05-01-2015', '$70,950'], 
    [1701,'     Robinson, Dorothy    ','  dorothy3@adventure-works.com    ', '(828) 555-0102', '03-01-2017', '$50,00'], 
    ],  

    columns=['BusinessEntityID', 'EmployeeName','EmailAddress', 'PhoneNumber', 'StartDate', 'CurrentSalary']
    ) 
 
print(df_employees.shape)
df_employees

(3, 6)

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary
0,1699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,"$80,950"
1,1700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,"$70,950"
2,1701,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,"$50,00"

In [4]:
df_employees.dtypes

BusinessEntityID     int64
EmployeeName        object
EmailAddress        object
PhoneNumber         object
StartDate           object
CurrentSalary       object
dtype: object

# 1. Cleaning dataframe

In [5]:
df_employees.drop("BusinessEntityID", axis='columns', inplace=True)

cols_to_rename = {
                   'EmployeeName':'Employee_Name', 
                   'EmailAddress' : 'Employee_Email', 
                   'PhoneNumber' : 'Employee_Phone', 
                   'StartDate' : 'Employee_Start', 
                   'CurrentSalary' : 'Employee_Salary'
                 }
df_employees.rename(columns = cols_to_rename, inplace=True)

In [6]:
df_employees['Employee_Salary'] = df_employees['Employee_Salary'].str.replace('$','')
df_employees['Employee_Salary'] = df_employees['Employee_Salary'].str.replace(',','')

df_employees['Employee_Salary'] = pd.to_numeric(df_employees['Employee_Salary']).astype(float)

C:\Users\W10\AppData\Local\Temp\ipykernel_14720\4191439950.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_employees['Employee_Salary'] = df_employees['Employee_Salary'].str.replace('$','')

In [7]:
df_employees['Employee_Start'] = pd.to_datetime(df_employees['Employee_Start'])

In [8]:
print("Ex 4.1 Part 2:", df_employees.shape)
df_employees.head()

Ex 4.1 Part 2: (3, 5)

,Employee_Name,Employee_Email,Employee_Phone,Employee_Start,Employee_Salary
0,"Robinett, David",david22@adventure-works.com,(827) 525-0100,2010-06-05,80950.0
1,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,2015-05-01,70950.0
2,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,2017-03-01,5000.0

In [9]:
df_employees.dtypes

Employee_Name              object
Employee_Email             object
Employee_Phone             object
Employee_Start     datetime64[ns]
Employee_Salary           float64
dtype: object